if not (type(gdRandomTips)=="table") then
	gdRandomTips = {}
end

gdRandomTips = {
	[1]="[g鹤嘴锄][y可以在][b矿洞][y挖矿挖到强化的材料。]",
	[2]="[y玩家到][g满级][y后可以转生哦。]",
	[3]="[y商城里可以买到酷炫的][g时装][y和][g翅膀][y哦。]",
	[4]="[y晚上8点到9点在][b英雄城][y将有攻城战哦。]",
	[5]="[g设置界面][y里可以设置技能的快捷键。]",
	[6]="[y玩家在][g30级][y以后将开放pk系统。]",
	[7]="[y玩家死亡会有机率掉出装备哦]",
	[8]="[g礼券][y和][g积分][y可以在商城里买到很多珍贵的道具。]",
	[9]="[y各种可爱的宠物可以帮您][b捡东西][y和][b摆摊][y哦。]",
	[10]="[y宠物背包中的物品在人物死亡后不会掉落。]",
	[11]="[y当人物的幸运值达到][b9或以上][y时，每次攻击都能造成][b最大][y伤害。]",
	[12]="[y单笔充值可以额外获得对应的翅膀奖励哦]",
	[13]="[y宠物在升级2级后可以帮主人拾取物品哦]",
	[14]="[y如果手机内存不太够的话，可以尝试游戏设置里设置屏蔽玩家]",
	[15]=0,
}
